c5/src/Reports/SalesRegister/SalesRegister.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>SalesRegister</name>
</mdclass:Report>

c5/src/Enums/PaymentMethods/PaymentMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PaymentMethods</name>
  <enumValues>
    <name>Cash</name>
  </enumValues>
  <enumValues>
    <name>Check</name>
  </enumValues>
  <enumValues>
    <name>Visa</name>
  </enumValues>
  <enumValues>
    <name>Mastercard</name>
  </enumValues>
  <enumValues>
    <name>AmericanExpress</name>
  </enumValues>
  <enumValues>
    <name>EFT</name>
  </enumValues>
  <enumValues>
    <name>Bank</name>
  </enumValues>
  <enumValues>
    <name>PayPal</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>ExpenseReport</name>
  </enumValues>
</mdclass:Enum>

c5/src/Reports/SalesRegister/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var Params export;

Procedure OnCompose () export	
	
	defineMethods ();
	
EndProcedure

Procedure defineMethods ()
	
	settings = Params.Settings;
	DC.GetParameter ( settings, "MethodCash" ).Value = String ( Enums.PaymentMethods.Cash );
	DC.GetParameter ( settings, "MethodCard" ).Value = String ( Enums.PaymentMethods.Card );
	DC.GetParameter ( settings, "MethodOther" ).Value = String ( Enums.PaymentMethods.Other );
	
EndProcedure 

#endif
